# please refer to repository: kql

#Summary

#This README houses queries that I have utilized. Inspiration for this document, my upskilling and some queries goes to reprise99, as well as: https://learnsentinel.blog/tag/kql/ and https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/microsoft-defender-for-endpoint-commonly-used-queries-and/ba-p/1795046?ref=rbwilson.ca
Commands/operators/functions overview

let

Allows you to create a variable and call back to it in a later instance (time, url, device)

union

Combine multiple device query tables (union DeviceProcessEvents, DeviceNetworkEvents)

join

Merge the rows of two tables to form a new table by matching values of the specified columns for each table

distinct

Acts as dedup in SPL, only focuses on results that are special, no duplicates

dcount()

Function - Calculates an estimate of the number of distinct values that are taken by scaler expression in the summary group. Null is ignored entirely.

top
top 100 by MachineCount
top 10 by avg_CPU
top 50 by Timestamp

Displays top X results

extend
extend = Duration = EndTime - StartTime

Create calculated columns and appends them to the result

project
| project TimeGenerated
| project StartLocation =  BeginLocation, TotalInjuries = InjuriesDirect + InjuriesIndirect
| where Totalinjuries > 5

Create columes, features: rename, drop, insert new computed columns, column order is specified by the order or arguments

summarize

Produces a table that aggregates the content of the input table. Can be used for extra features such as creating visualisations and counts

parse_json()

Function - Interprets string as JSON value, returns value as dynamic

extract_json()

Function - When you need to extract more than one element of a JSON compound object. Use dynamic() when possible

tostring()

Function - Very commonly used with summarize to convert a value to a string (specifically numbers i.e. tostring(123)

series_stats()
print x=dynamic([23, 46, 23, 87, 4, 8, 3, 75, 2, 56, 13, 75, 32, 16, 29]) 
| project series_stats(x)

Function - Returns statistics for numerical series in a table with a column for each statistic

count
CommonSecurityLog
| count

Operator - Returns the number of records for the input record set

count()
StormEvents
| summarize Count=count() by State

Function - Counts the number of records per summarization group or total if summarization is done without grouping. Null values are ignored entirely.
Useful KQL Queries

CommonSecurityLog
| where DestinationIP == "<IP>"

Check CommonSecurityLog for dest. ip

CommonSecurityLog
| where DestinationDomainName == "<domain name>"

Checks CommonSecurityLog for Dest. domain name

CommonSecurityLog
| where SourceIP == "<IP>"

Check CommonSecurityLog for Source IP

SignInLogs
| where SigninLogs == "<IP>"

Check SigninLogs for IP address

SignInLogs
| where UserPrincipalName == "<User Email>"

Check SigninLogs for UserPrincipalName

SecurityAlert
| where AlertName contains "ti map"
| where tostirng(Entities) !contains "23.227.38."
| summarize by tostring (Entities)

Check Security Alert for AlertName containing "Ti map"
The string does not contain ""
Then summarize by entities in string format

SigninLogs
| where UserPrincipalName =~ "John.Smith@domain.com" and ResultType == "0" //and IPAddress != "<IP>"
| summarize by TimeGenerated, UserPrincipalName, AppDisplayName, IPAddress, tostring(DeviceDetail)

Check SigninLogs for specific user, result type and/or not specific ip address

OfficeActivity
| where Operation == "New-InboxRule and UserId contains "<User's last name>"
| summarize by tostring(Parameters) and DeviceAction != "Blocked" and UserId contains "<User's last name>"

Check OfficeActivity for New-Inbox Rules tied to user's last name, summarize any DeviceAction that was not Blocked, show parameters in string format. Performed on compromised account.

OfficeActivity
| find "<domain>"
| summarize by tostring(Parameters)

find <ip/host/whatever>
To find a field that isn't showing, then use the field that appears

SigninLogs
| where UserDisplayName == "<Username>"
| project TimeGenerated, IPAddress, Location, LocationDetails, UserAgent, Status

Outdated default sign in logs checker

SigninLogs
| where UserPrincipalName == "John.Smith@domain.com"
| project TimeGenerated, UserDisplayName, AppDisplayName, IPAddress, Location, LocationDetails, Status, AuthenticationRequirement

Outdated default sign in logs checks #2

SigninLogs
| where UserPrincipalName == "John.Smith@domain.com"
| summarize count by <field>
| project TimeGenerated, UserDisplayName, LocationDetails_string, AppDisplayName, ResourceDisplayName, Status_string

Add to end of event logs query

SigninLogs
| where UserPrincipalName == "John.Smith@domain.com"
//| where IPAddress == "<IP>"
| summarize by TimeGenerated, UserPrincipalName, Location, tostring(Status), tostring(DeviceDetail), IPAddress, AppDisplayName, tostring(LocationDetails), AuthenticationRequirement, tostring(MfaDetail), AuthenticationDetails

Check SigninLogs for particular user and/or IPAddress then summarize by filters
Formerly my primary SigninLogs query

CommonSecurityLog
| where DestinationHostName == "<domain>" //and SourceIP == "<IP>"
//| where DestinationIP == "<IP>" //and SourceIP == "<IP>"
| project TimeGenerated, DeviceAction, Activity, DestinationHostName, RequestURL, RequestContext, SourceIP, SourceUserName, SourceTranslatedAddress

Check CommonSecurityLog for DestinationhostName and/or SourceIP, and/or DestinaionIP and/or SourceIP then project using filters
Formerly my primary CommonSecurityLog query

AzureActivity
| where Caller == "<alphanumeric>"

Basic AzureActivity, searches for caller

DeviceInfo
| where OnboardingStatus == "Can be onboarded" and OSPlatform contains ("WindowsServer")

Simplified KQL query for looking for servers to be onboarded. Wed Theme (EDR) day specific.
Still needs fine-tuning. Something exists within defender which makes this query unusable. I need to ifugre out what this is then apply it here

DeviceInfo
| where OnboardingStatus == "Can be onboarded" and OSPlatform contains ("WindowsServer")
| where DeviceCategory contains "Endpoint"
| distinct DeviceName

Resolved the above via:
Utilization of time
Specifying the need for endpoints
Utilizing distinct to minimise results

DeviceInfo
| where OnboardingStatus == "Can be onboarded" and OSPlatform contains ("WindowsServer")
| where DeviceCategory contains "Endpoint"
| distinct DeviceName, OSPlatform, OSVersionInfo, DeviceType, OnboardingStatus

More honed in results of the above
Can be utilized in Wed Theme Day

IdentityInfo
| where AccountUpn == "<user>"
| distinct AccountUpn, CreatedDateTime, JobTitle, City, Country

KQL query for fast identityinfo acquisition of user

IdentityInfo
| where AccountUpn == "<user>"
| distinct AccountUpn, IsAccountEnabled, CreatedDateTime, JobTitle, City, Country

Above but now with new and improved IsAccountEnabled

IdentityInfo
| where AccountUPN == "<user>"
| distinct AccountUPN, IsAccountEnabled, AccountCreationTime, JobTitle, City, Country

Sentinel specific

IdentityInfo
| where CreatedDateTime > ago (30d)
//| where isnotempty(AccountUpn)
//| where IsAccountEnabled != "0"
| project AccountMain = AccountUpn, IsAccountEnabled, CreatedDateTime, JobTitle, City, Country
| join (DeviceInfo
  | where Timestamp > ago(30d)
//| where LoggedOnUsers != "[]"
  | project DeviceMain = DeviceName, LoggedOnUsers, JoinType
  )
  on $left.AccountMain == $right.DeviceMain

Above but has addition of DeviceInfo to enrich the information more
Broken current however, provides results but the results are blank

IdentityInfo
| where UserPrincipalName == "<user>"
| project AccountMain = AccountUpn, IsAccountEnabled, CreatedDateTime, JobTitle, City, Country
| join (DeviceInfo
  | where Timestamp > ago(30d)
  | extend UserName = parse_json(LoggedOnUsers)
  | mv-expand UserName
  | project DeviceMain = DeviceName, LoggedOnUsers, JoinType
  )
  on $left.AccountMain == $right.DeviceMain

Fixed above using this kql query

DeviceFileEvents
| where FileName endswith ".crx"

Review files for file format: .crx (chrome web extensions)

DeviceNetworkEvents
| where Timestamp between (ago(5h) .. ago(3h))
| where DeviceName contains "<device.internaldomain>" //and RemoteIP == "<IP>"

Check DeviceNetworkEvents for activity between timestamps (2h period) for particular device and IP. Associated with "Hunt for related activity"

let selectedTimestamp = datetime(<time>)
search in (DeviceNetworkEvents)
Timestamp between ((selectedTimestamp - 30m) .. (selectedTimestamp + 30m))
and DeviceName == "<device>"
| sort by Timestamp desc
| extend Relevance = ifff(Timestamp == selectedTimestamp, "Selected event", ifff(Timestamp < selectedTimestamp, "Earlier event", "Later event"))
| project-reorder Relevance

Check DeviceNetworkEvents for particular device related activity during specific time. Automated query from "Hunt for related events" in Device Timeline. No added filters alongside relevance

let selectedTimestamp = datetime(<time>)
search in (DeviceNetworkEvents)
Timestamp between ((selectedTimestamp - 30m) .. (selectedTimestamp + 30m))
and DeviceName == "<device>"
| sort by Timestamp desc
| extend Relevance = ifff(Timestamp == selectedTimestamp, "Selected event", ifff(Timestamp < selectedTimestamp, "Earlier event", "Later event"))
| project-reorder Relevance, RemoteUrl, RemoteIP

Check DeviceNetworkEvents for particular device related actvity during specific time. Automated query from "Hunt for related events" in Device Timeline but honed in with extra project-reorder filters

AADServicePrincipalSigninLogs
| where IPAddress == "<IP>"
| project by TimeGenerated, ServicePrincipalName, Location, ConditionalAccessStatus, IPAddress, LocationDetails, ResultType

Useful for unusual data center login

AzureDiagnostics
| where userAgent_s == "<useragent>"
| project TimeGenerated, clientIP_s, clientIp_s, httpStatusCode_d

Check AzureDiagnostics for particular Malformed User Agent

DeviceNetworkEvents
| where Timestamp > ago(7d)
| where DeviceName contains "<device>"
| project Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, RemotePort

Useful for TI Maps, review browsing activity for particular device over 7 day period

DeviceNetworkEvents
| where Timestamp > ago(7d)
| where RemoteIP contains "<IP>"
| project Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, RemotePort

Useful for TI Maps, review browsing activity for particular IP over 7 day period

DeviceNetworkEvents
| where Timestamp > ago(7d)
| where RemoteUrl contains "<Url>"
| project Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, RemotePort

Useful for TI Maps, review browsing activity for particular url/domain over 7 day period

AADNonInteractiveSigninLogs
| where TimeGenerated > ago(30d)
| where UserPrincipalName == "<User>"
//| where IPAddress == "<IP>"
//| where AppDisplayName == "<App>"
//| where ResultType contains "53005"
| summarize by TimeGenerated, UserPrincipalName, Location, tostring(Status), tostring(DeviceDetail), IPAddress, AppDisplayName, tostring(LocationDetails), AuthenticationRequirement, tostirng(MfaDetail), AuthenticationDetails, ResultType

Useful for failed login alerts

AzureActivity
| where Caller == "<Caller>"
| where OperationNameValue has_any ("MICROSOFT.SECURITYINSIGHTS/ALERTRULES/DELETE", "MICROSOFT.SECURITYINSIGHTS/WATCHLISTS/DELETE")
| project TimeGenerated, OperationNameValue, ResourceGroup, Caller, CallerIpAddress, Type

Useful for mass cloud resource deletion

DeviceNetworkEvents
| where RemoteUrl contains "libgen"
| summarize count() by RemoteUrl

Displays urls associated to suspicious domain - ti map related - wider search for activity related to a suspicious domain

DeviceNetworkEvents
| where DeviceName contains "<Device>"
| project Timestamp, DeviceName, ActionType, RemoteIP, RemotePort, RemoteUrl, InitiatingProcessVersionInfoInternalFileName

Check DeviceNetworkEvents for devicename, then project using filters - ti map specific

Syslog
| where TimeGenerated > ago(4d)
| where SyslogMessage contains "<svc account>"
| project TimeGenerated, SyslogMessage

Useful for Multiple RDP connections made by a single system

CommonSecurityLog
| where TimeGenerated > ago(7d)
| where DeviceVendor == "Cyber-Ark" and DeviceProduct == "Vault" //and DeviceEventClassID == "309"
| where SourceUserName == "<user>"
| project TimeGenerated, DeviceEventClassID, Activity, SourceUserName

Check commonsecuritylog for CyberArk activity - Useful for: - CyberArk Undefined User Login

AzureDiagnostics
| where userAgent_s == "<useragent>"
| where timestamp == <time>
| project TimeGenerated, clientIP_s, clientIp_s, httpStatusCode_d

Check AzureDiagnostics for particular Malformed User Agent

let selectedTimestamp = datetime('YYYY-MM-DDTHH:MM:SS.MSZ')
CommonSecurityLog
| where TimeGenerated between ((selectedTimestamp - 30m) .. (selectedTimestamp + 30m))
//| where DestinationHostName == "<Domain>" //and SourceIP == "<IP>"
| where DestinationIP == "<IP>" //and SourceIP == "<IP>"
| project TimeGenerated, DeviceVendor, DeviceProduct, DeviceAction, Activity, DestinationHostName, DestinationIP, DestinationPort, SourceIP, SourcePort, RequestURL, RequestContext, SourceUserName, SourceTranslatedAddress

Check CommonSecurityLog for specific timestamp 30mins forwards and backwards via the Dest. IP, then project results

DeviceProcessEvents
| where Timestamp > ago(1h)
| summarize avg(CPU) by ProcessName
| top 10 by avg_CPU

Returns the top 10 processes by CPU usage in the last hour

DeviceFileEvents 
| where SHA1 == "4aa9deb33c936c0087fb05e312ca1f09369acd27"  

Check DeviceFileEvents for SHA1 file hash

DeviceEvents 
| where ActionType in ("FirewallOutboundConnectionBlocked", "FirewallInboundConnectionBlocked", "FirewallInboundConnectionToAppBlocked") 
| project DeviceId , Timestamp , InitiatingProcessFileName , InitiatingProcessParentFileName, RemoteIP, RemotePort, LocalIP, LocalPort 
| summarize MachineCount=dcount(DeviceId) by RemoteIP 
| top 100 by MachineCount desc 

Check DeviceEvents for devices associated with Firewall Blocked

DeviceLogonEvents 
| where isnotempty(RemoteIP)  
    and AccountName !endswith "$" 
    and RemoteIPType == "Public" 
| extend Account=strcat(AccountDomain, "\\", AccountName) 
| summarize  
    Successful=countif(ActionType == "LogonSuccess"), 
    Failed = countif(ActionType == "LogonFailed"), 
    FailedAccountsCount = dcountif(Account, ActionType == "LogonFailed"), 
    SuccessfulAccountsCount = dcountif(Account, ActionType == "LogonSuccess"), 
    FailedAccounts = makeset(iff(ActionType == "LogonFailed", Account, ""), 5), 
    SuccessfulAccounts = makeset(iff(ActionType == "LogonSuccess", Account, ""), 5) 
    by DeviceName, RemoteIP, RemoteIPType 
| where Failed > 10 and Successful > 0 and FailedAccountsCount > 2 and SuccessfulAccountsCount == 1  

Look for public IP addresses with multiple failed logon attempts, using multiple accounts and eventually succeeded

// Note - RemoteDeviceName is not available in all remote logon attempts 
DeviceLogonEvents 
| where isnotempty(RemoteDeviceName) 
| extend Account=strcat(AccountDomain, "\\", AccountName) 
| summarize  
    Successful=countif(ActionType == "LogonSuccess"), 
    Failed = countif(ActionType == "LogonFailed"), 
    FailedAccountsCount = dcountif(Account, ActionType == "LogonFailed"), 
    SuccessfulAccountsCount = dcountif(Account, ActionType == "LogonSuccess"), 
    FailedComputerCount = dcountif(DeviceName, ActionType == "LogonFailed"), 
    SuccessfulComputerCount = dcountif(DeviceName, ActionType == "LogonSuccess") 
    by RemoteDeviceName 
| where 
    Successful > 0 and 
    ((FailedComputerCount > 100 and FailedComputerCount > SuccessfulComputerCount) or 
        (FailedAccountsCount > 100 and FailedAccountsCount > SuccessfulAccountsCount)) 

Check DeviceLogonEvents for failed log-ons to multiple machines or using multiple accounts

DeviceEvents 
| where ActionType in ("AntivirusScanCompleted", "AntivirusScanCancelled") 
| extend A=parse_json(AdditionalFields)  
| project Timestamp, DeviceName, ActionType,ScanType = A.ScanTypeIndex, StartedBy= A.User 
| sort by Timestamp desc 

Check DeviceEvents for Defender Scan Actions completed or cancelled

let Domain = "<suspicious domain/url>";
DeviceNetworkEvents
| where Timestamp > ago(7d) and RemoteUrl contains Domain
| project Timestamp, DeviceName, RemotePort, Remoteurl
| top 100 by Timestamp desc

Check DeviceNetworkEvents for communication with specific domain/url

union DeviceProcessEvents, DeviceNetworkEvents
| where Timestamp > ago(7d)
| where FileName in~ ("powershell.exe","powershell_ise.exe")
| where ProcessCommandLine has_any("WebClient","DownloadFile","DownloadData","DownloadString","WebRequest","Shellcode","http","https")
| project Timestamp, DeviceName, InitiatingProcessFuileName, InitiatingProcessCommandLine, FileName, ProcessCommandLine, RemoteIP, RemoteUrl, RemotePort, RemoteIPType
| top 100 by Timestamp

Check DeviceProcessEvents and DeviceNetworkEvents via union (combine multiple device query tables), for powershell execution events associated with downloading

DeviceProcessEvents 
| where FolderPath endswith "\\schtasks.exe" and ProcessCommandLine has "/create" and AccountName != "system" 
| where Timestamp > ago(7d) 

Check DeviceProcessEvents for scheduled tasks created by non-system accounts

DeviceRegistryEvents  
| where ActionType == "RegistryValueSet"  
| where RegistryValueName == "DefaultPassword"  
| where RegistryKey has @"SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon" 
| project Timestamp, DeviceName, RegistryKey | top 100 by Timestamp 

Check DeviceRegistryEvents for possible clear text passwords in twindows registry

DeviceProcessEvents 
| where Timestamp > ago(14d) 
| where ProcessCommandLine contains ".decode('base64')" or ProcessCommandLine contains "base64 --decode" or ProcessCommandLine contains ".decode64(" 
| project Timestamp , DeviceName , FileName , FolderPath , ProcessCommandLine , InitiatingProcessCommandLine  
| top 100 by Timestamp 

CheckProcessEvents for process executed from binary hidden in base64 encoded file
