=== phish_master doc - sentinel focus ===

--- associated alert ---
> Connection to adversary-in-the-middle (AiTM) phishing site on one endpoint

--- items/software required for procedure ---
> Windows Sandbox
Isolated environment for testing purposes
> Smartphone
Access to a different, less secure network for testing purpoes
> Microsoft Defender
Alert analysis, in-depth investigation via Advanced Hunting search
> Microsoft Sentinel
Alert analysis, base level investigation via log search
> IP information gathering tool: Abuseipdb
IP Information gathering security tool
> IP VPN/Proxy Checker: ip2proxy.com/ipinfo.io
IP VPN/proxy chcker secuity tool

--- procedure ---
1. Gather relevant information
Domain: <domain>
Port: 80/443 indicates web server/site
IP address: <IP address>
Device: <Device>
User: John.Smith@domain.com

Also grab the other ip involved, the one that established the connection. Ensure it is a non-suspicious IP by utilizing abuseIPDB along with a VPN/proxy checker security tool.

2. Investigation phase
Using Microsoft Sentinel, gather user details:
User: John.Smith@domain.com
Role: <Role>
Location: <Location>

Location will be key here as you can use this later to compare the user’s EntraID location to recent sign ins to ensure the account hasn’t been compromised recently.

Using MS Defender > Hunting > Advanced Hunting…
Begin  your review of specific datatypes:
EmailEvents
EmailUrlInfo
UrlClickEvents
DeviceEvents
DeviceNetworkEvents

Please review the Sentinel queries located below.

3. Device Timeline Scanning
Review the device involved for events associated with the doamin, ensure that it was blocked via Microsoft SafeScreen or if the activity was blocked outright

Also be aware of outside sharepoint links.

4. Determination
Make a judgement call on whether to escalate the activity.

IN THIS INSTANCE OF PHISHING SITE, it is a requirement to escalate.

Follow the incident escalation procedure.

Congratulations, you have performed a phish investigation to the level of a master.

--- remediation ---
1. Filter network traffic - block all network traffic not necessary within environment
2. Network Intrusion Detection and Prevention - Identify traffic patterns indicative of AiTM behavior and mitigate activity at the network level
3. User training - Train users to be suspicious about certificate errirs abd phishing emails
4. Continued monitoring of application logs, network traffic, files, services etc.
5. Software configuration - Use anti-spoofing and email auth mechanisms to filter messages based on validity checks on the sender domain: SPF, DMARC, DKIM
6. Password reset in case the user knowingly or unknowingly inputted their credentials

--- notes ---
> Even though the domain may lead nowhere for you, there can be a special link that needs to be accessed via a specific path for the phishing page to appear
> Look for any suspicious sharepoint links or anything that appears unrelated to the business in the Device Timeline

--- useful kql queries ---
EmailEvents
| where SenderIPv4 contains “1.2.3.4”
Finds emails sent by Ipv4 address

EmailUrlInfo
| where UrlDomain contains “sample.com”
| join EmailEvents on NetworkMessageId
| join UrlClickEvents on NetworkMessageId
Sample combining filters.
This query can be combined with the filters above to locate the link clicks on the emails you want

EmailEvents
| where SenderFromAddress contains “example.com”
Find emails based on sender address

EmailEvents
| Where Subject contains “example”
Finds emails based on subject

UrlClickEvents
| where NetworkMessageId in (‘<alphanumeric>’,’<alphanumeric>’,’<alphanumeric>’)
Find URL clicks on a list of message IDs

EmailEvents
| where NetworkMessageId == “<alphanumeric>”
Find email events associated with NetworkMessageId “<message id>”

EmailUrlInfo
| where Url contains “<google.com>”
Find email url info associated with url “<url>”

DeviceEvents
| where InitiatingProcesssAccountUpn contains “<John.Smith@domain.com>”
Find device network events associated with user: “<John.Smith@domain.com>”

DeviceNetworkEvents
| where RemoteUrl contains “<google.com>”
Find device network events associated with url: “<google.com>”
