=== splunk_playbook ===

| eventcount summarize=false index=* | dedup index | fields index
List all indexes

<query>
| field <field> <field>
| table <field> <field>
| dedup <field> <field>
More efficient search with honed in results

user auth over 7 day period also utilized

user search, captures user_bunit/role info

Email marked as junk/not junk
index=<mail index> sourcetype=<related sourcetype> user=<user>
| fillnull value=Missing
| stats count by _time data P1SenderDomain P2Sender P2SenderDomain Recipients[] SenderIP subject DeliveryMessageInfo.DeliveryReason DeliveryMessageInfo.Desintination

Azure Risky Sign In
index=<azure index> sourcetype=<related sourcetype> userDisplayName=<user>
| fillnull value=NULL
| stats count by _time userDisplayName authenticationDetails{}.authenticationStepResultDetail ipAddress deviceDetail.isCompliant deviceDetail.isManaged

Windows Domain Trust Modification via Windows Event Code
Event ID 4716
Trusted domain information was modified by Microsoft Security recommendation - account reported in event is Anonymous logon, password was automatically changed. Event was followed by Event ID 4742. Not suspicious, NFA.

Event ID 4742 is a computer account change. Occurs at same time and is not suspicious.

index=<windows event logs> sourcetype=<related sourcetype> host/machine=<machine> EventID IN (4716 4742)
| fillnull value=Missing
| stats count by _time host EventID Caller_User_Name SubjectDomainName

New Inbox Rule
If pointing to external mail address, escalation necessary.

index=<mail index> sourcetype=<related sourcetype> user=<user> Operation=New-InboxRule

Azure enabled from disabled state
index=<azure index> targetResources{}.userPrincipalName IN (<UPN> <UPN>) activityDisplayName IN ("Disable account","Enable account")
| dedup activityDisplayName initiatedBy.user.userPricipalName targetResources{}.userPrincipalName
| table _time activityDisplayName sourcetype

To check who made changes, it is usually a password reset
index=<windows event log> user=<user> EventCode IN (4725,4722,4723,4724)
| fillnull value="Missing"
| stats count by _time EventCode signature EventData_Xml SubjectUserName TargetUserName

Tenable OT Security High Severity Detection
index=<tenable ot index> sourcetype=<related sourcetype> host=<related host>
| fields _time action category src_user src_ip duser dest_ip dest_port proto
| table _time action category src_user src_ip duser dest_ip dest_port proto

Review user web traffic over 7 day period

| tstats `summariesonly` fillnull_value="MISSING" count from datamodel=Web where earliest=-7d latest=now Web.user IN ("PLACEHOLDER" "PLACEHOLDER") by _time Web.url Web.src Web.dest Web.action web.user Web.category index sourcetype
| `drop_dm_object_name(Web)`
| lookup netblock_tracking_output customer_network as src OUTPUT customer_network as src_customer_network customer_vlan assrc_customer_vlan customer_vrf as src_customer_vrf customer_description as src_customer_description customer_building as src_customer_building customer_site as src_customer_site
| fillnull src_customer_network src_customer_vlan src_customer_vrf src_customer_description src_customer_building src_customer_site category value="MISSING"
| eval user=lower(user),src_ip=if(cidrmatch("0.0.0.0/0",src) OR cidrmatch("::/0",src),replace(src,"^::ffff:"),"MISSING"), src_ip_24=if(cidrmatch("0.0.0.0/0",src_ip),src_ip,"MISSING")
| `convert_24_rex(src_ip_24)`
| `convert_24_rex(dest_ip_24)`
| stats count by user src src_customer_description category url action

