kql_playbook

CommonSecurityLogs
| where DestinationIP == "<IP>"
Check CommonSecurityLogs for dest. ip

CommonSecuityLogs
| where DestinationDomainName == "<domain name>"
Checks CommonSecurityLogs for Dest. domain name

CommonSecurityLogs
| where SourceIP == "<IP>"
Chcek CommonSecurityLogs for Source IP

SignInLogs
| where SigninLogs == "<IP>"
Check SigninLogs for IP address

SignInLogs
| where UserPrincipalName == "<User Email>"
Check SigninLogs for UserPrincipalName

SecurityAlert
| where AlertName contains "ti map"
| where tostirng(Entities) !contains "23.227.38."
| summarize by tostring (Entities)
Check Security Alert for AlertName containing "Ti map"
The string does not contain "<ip>"
Then summarize by entities in string format

SigninLogs
| where UserPrincipalName =~ "John.Smith@domain.com" and ResultType == "0" //and IPAddress != "<IP>"
| summarize by TimeGenerated, UserPrincipalName, AppDisplayName, IPAddress, tostring(DeviceDetail)

OfficeActivity
| where Operation == "New-InboxRule and UserId contains "<User's last name>"
| summarize by tostring(Parameters) and DeviceAction != "Blocked" and UserId contains "<User's last name>"
Check OfficeActivity for New-Inbox Rules tied to user's last name, summarize any DeviceAction that was not Blocked, show parameters in string format. Performed on compromised account.

OfficeActivity
| find "<domain>"
| summarize by tostring(Parameters)

find <ip/host/whatever>
To find a field that isn't showing, then use the field that appears

SigninLogs
| where UserDisplayName == "<Username>"
| project TimeGenerated, IPAddress, Location, LocationDetails, UserAgent, Status
Outdated default sign in logs checker

SigninLogs
| where UserPrincipalName == "John.Smith@domain.com"
| project TimeGenerated, UserDisplayName, AppDisplayName, IPAddress, Location, LocationDetails, Status, AuthenticationRequirement
Outdated default sign in logs checks #2

SigninLogs
| where UserPrincipalName == "John.Smith@domain.com"
| summarize count by <field>

| project TimeGenerated, UserDisplayName, LocationDetails_string, AppDisplayName, ResourceDisplayName, Status_string
Add to end of event logs query

SigninLogs
| where UserPrincipalName == "John.Smith@domain.com"
//| where IPAddress == "<IP>"
| summarize by TimeGenerated, UserPrincipalName, Location, tostring(Status), tostring(DeviceDetail), IPAddress, AppDisplayName, tostring(LocationDetails), AuthenticationRequirement, tostring(MfaDetail), AuthenticationDetails
MY PRIMARY SIGNINLOGS SEARCH I USE DAILY

CommonSecurityLogs
| where DestinationHostName == "<domain>" //and SourceIP == "<IP>"
//| where DestinationIP == "<IP>" //and SourceIP == "<IP>"
| project TimeGenerated, DeviceAction, Activity, DestinationHostName, RequestURL, RequestContext, SourceIP, SourceUserName, SourceTranslatedAddress
MY PRIMARY COMMONSECURITYLOGS SEARCH I USE DAILY

AzureActivity
| where Caller == "<alphanumeric>"

AzureDiagnostics
| where userAgent_s contains "<UserAgent>" and clientIP_s == "<IP>"
| summarize by TimeGenerated, ResourceGroup, Resource, OperationName, requestUri_s, httpStatus_d
Malformed User Agent query

AADNonInteractiveSignInLogs
| where UserPrincipalName == "John.Smith@domain.com"
//| where IPAddress == "<IP>"
| summarize by TimeGenerated, UserPrincipalName, Location, tostring(Status), tostring(DeviceDetail), IPAddress, AppDisplayName, tostring(LocationDetails), AuthenticationRequirement, tostring(MfaDetail), AuthenticationDetails
MY PRIMARY AADNONINTERACTIVESIGNINLOGS SEARCH I USE REGULARLY

AsimDnsActivityLogs
| where DnsQuery contains "<domain.com>"
| summmarize by TimeGenerated, DnsQuery, DstIpAddr, SrcIpAddr, DvcHostname, EventResult
Suspicious communication over dns on one endpoint kql query

IdentityInfo
| where AccountCreationTime between (now(-14d) .. now())
| summarize by AccountName
Identity and Access Management Theme KQL query
Review over the last 2 weeks

SecurityAlert
| where AlertName contains "Suspected brute-force"
| summarize arg_max(TimeGenerated,*) by SystemAlertId
//| project Description
Display alerts titled Suspected brute force then summarizes them by TimeGenerateed and SystemAlertId

AuditLogs
| where OperationName startswith "Update"
| summarize count() by OperationName
Condiitonal Access Policy Modified related

EmailEvents
| where SenderIPv4 contains "1.2.3.4"
Finds emails by ipv4 address

EmailUrlInfo
| where UrlDomain contains "sample.com"
| join EmailEvents on NetworkMessageId
| join UrlClickEvents on NetworkMessageId
Same combining filters
This query can be combined with the filters above to locate the link clicks on emails you want

EmailEvent
| where SenderFromAddress contains "example.com"
Finds emails based on sender address

EmailEvents
| where Subject contains "example"
Finds emails based on subject

UrlClickEvents
| where NetworkMessageID in ('<alphanumeric>','<alphanumeric>','<alphanumeric>')
Finds url clicks in a list of message ids

EmailAttachmentInfo
| where FileName contains "<FileName>"
| join EmailEvents on NetworkMessageId
Finds emails where a file with a specific name is attached

DeviceProcessEvents
| where ProcessCommandLine contains "<FileName>"
Find events where a file was executed

DeviceEvents
| where FileName contains "<FileName>"
Find events where a file was executed

DeviceFileEvents
| where FileName contains "<FileName>"
| where ActionType contains "Created"
Find files matching a file name on endpoints

SigninLogs
| where TimeGenerated > ago(30d)
| where UserPrincipalName == "<Username>"
//| where IPAddress == "<IP>"
//| where ResultType contains "53005"
| summarize by TimeGenerated, UserPrincipalName, Location, tostring(Status), tostring(DeviceDetail), IPAddress, AppDisplayName, tostring(LocationDetails), AuthenticationRequirement, tostring(MfaDetail), AuthenticationDetails, ResultType
THE ULTIMATE NEW SIGNINLOGS QUERY THAT I USE, incorporates timegen into the query itself

AADNonInteractiveSignInLogs
| where TimeGenerated > ago(30d)
| where UserPrincipalName == "<Username>"
//| where IPAddress == "<IP>"
//| where ResultType contains "53005"
| summarize by TimeGenerated, UserPrincipalName, Location, tostring(Status), tostring(DeviceDetail), IPAddress, AppDisplayName, tostring(LocationDetails), AuthenticationRequirement, tostring(MfaDetail), AuthenticationDetails, ResultType
THE ULTIMATE NEW AADNONINTERACTIVESIGNINLOGS QUERY THAT I USE, incorporates timegen into the query itself. Also has added resulttype for viewing suspicious IPs

IdentityInfo
| where AccountUPN endswith "<Ext. domain.com>" AND IsAccountEnabled == "true"
IdentityInfo query that looks for external domain users that are enabled within EntraID for your business
